#### Terraform fmt for dev `success`
#### Terraform init for dev `success`
#### Terraform validate for dev `success`
#### Terraform plan for dev `success`

<details><summary>Show plan result for dev </summary>

```

provision
random_password.vm_password: Refreshing state... [id=none]
proxmox_virtual_environment_download_file.debian_12_cloud_image: Refreshing state... [id=local:iso/debian_12_cloud_image.img]
proxmox_virtual_environment_vm.dev_vm: Refreshing state... [id=100]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # proxmox_virtual_environment_download_file.debian_12_cloud_image has been deleted
  - resource "proxmox_virtual_environment_download_file" "debian_12_cloud_image" {
      - id             = "local:iso/debian_12_cloud_image.img" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.debian_12_cloud_image will be created
  + resource "proxmox_virtual_environment_download_file" "debian_12_cloud_image" {
      + content_type   = "iso"
      + datastore_id   = "local"
      + file_name      = "debian_12_cloud_image.img"
      + id             = (known after apply)
      + node_name      = "pve"
      + overwrite      = true
      + size           = (known after apply)
      + upload_timeout = 600
      + url            = "https://cloud.debian.org/images/cloud/bookworm/latest/debian-12-generic-amd64.qcow2"
      + verify         = true
    }

  # proxmox_virtual_environment_vm.dev_vm is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "dev_vm" {
      ~ id                      = "100" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:89:0D:9B",
        ] -> (known after apply)
        name                    = "dev"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
      - tags                    = [] -> null
        # (20 unchanged attributes hidden)

      ~ cpu {
          + architecture = "x86_64"
          - flags        = [] -> null
            # (7 unchanged attributes hidden)
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-zfs"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + file_id           = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 128
          + ssd               = true
        }

      ~ initialization {
          - interface    = "ide2" -> null
            # (1 unchanged attribute hidden)

          ~ dns {
              - servers = [] -> null
                # (1 unchanged attribute hidden)
            }

          ~ user_account {
              ~ password = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "BC:24:11:89:0D:9B" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with proxmox_virtual_environment_vm.dev_vm,
  on debian.tf line 115, in resource "proxmox_virtual_environment_vm" "dev_vm":
 115:       server = "192.168.${var.tag}.1"

The `server` attribute is deprecated and will be removed in a future release.
Please use the `servers` attribute instead.

Warning: The file does not exist in datastore and resource must be recreated.

  with proxmox_virtual_environment_download_file.debian_12_cloud_image,
  on debian.tf line 128, in resource "proxmox_virtual_environment_download_file" "debian_12_cloud_image":
 128: resource "proxmox_virtual_environment_download_file" "debian_12_cloud_image" {

file does not exists in datastore

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vpletea, Action: `pull_request`*